{
	"areas":
	[
		{
			"name":"1. Behovsinsamling",
			"questions":
			[
				{
                    "name":"Lösningar",
					"description":"Behov skall uttryckas i termer av det affärsvärde de förväntas leverera. Detta skapas och levereras sedan som en minsta värdefull  produkt (eng. ”minimum viable product”, MVP) i en kontinuerlig leverans.",
					"question":"Betygsätt teamets förmåga att översätta behov till tydliga och mätbara lösningsförslag.",
					"image":"/images/explore1.png",
					"sit":"Behov är vaga eller odefinierade.",
					"crawl":"Behov är definierade men innehåller inga lösningsförslag.",
					"walk":"Några behov är uttryckta med mätbara lösningsförslag.",
					"run":"De flesta behoven är utryckta med mätbara lösningsförslag och levereras med en MVP.",
					"fly":"Alla behoven är utryckta med mätbara lösningsförslag och levereras med en MVP."
				},
				{
                    "name":"Samarbete",
					"description":"Samarbeten och undersökningar innebär att verksamheten involveras.  behovsspecialister arbetar direkt med slutanvändare, intressenter och ämnesexperter för att förstå verksamhetens behov och identifierar specifika affärsresultat och tillhörande mätvärden för att styra leveranslösningar.",
					"image":"/images/explore2.png",
					"question":"Betygsätt förvaltningsområdet förmåga att samarbeta mellan verksamheten och IT för att definiera välformulerade lösningsförslag som stödjer behoven, samt att inkludera dessa i marknadsföringsbara funktioner.",
					"sit":"Roller och ansvar för verksamhetsområdet är odefinierade eller följs inte.",
					"crawl":"Verksamhetsområdet skapar behov och lösningar i omgångar med lite samarbete mellan verksamhet och IT.",
					"walk":"Verksamhetsområdet samarbetar med verksamhetens och IT:s experter, men inte med båda när man definierar behoven.",
					"run":"Verksamhetsområdet samarbetar regelbundet med verksamhetens och IT:s experter, men inkluderar inte behoven i marknadsföringsbara funktioner.",
					"fly":"Förvaltningsområdet samarbetar alltid med verksamheten och IT experter och inkluderar behoven i marknadsföringsbara funktioner."
				},
				{
                    "name":"Arkitektur",
					"description":"Att arkitekturen stödjer en kontinuerlig leverans vid behov, vilket innebär att man använder \"tillräckligt\" lösa kopplingar mellan system att man minimerar beroenden, risker för teknisk skuld och svårigheter att kunna leverera mindre lösningar kontinuerligt. (low coupling high cohesion)",
					"question":"Bedöm teamets förmåga att skapa lösningar som går att separat leverera kontinuerligt.",
					"image":"/images/explore3.png",
					"sit":"Det är svårt att genomföra förändringar, det finns komplexa beroenden mellan många komponenter och system (ömtåligt).",
					"crawl":"Vissa system är separerade men det mesta är komplext och sammankopplat.",
					"walk":"Det mesta är separerat men det tillåter inte ”Leverans vid behov”.",
					"run":"Få sammankopplade system och leveranser är baserat på att leverera värde.",
					"fly":"Arkitekturen är byggd för ”Release vid behov”."
				},
				{
                    "name":"Funktion",
					"description":"Syntetisering innebär att man sätter samman resultaten från lösningsförslag, samarbeten och arkitektur för att skapa välformade, prioriterade funktioner. Man aggregerar flera behov till övergripande marknadsföringsbara funktioner som blir behållare för den kontinuerliga värdeleveransen.",
					"question":"Bedöm teamets förmåga att kontinuerligt utforska och utveckla behov i backloggen",
					"image":"/images/explore4.png",
					"sit":"Det finns ingen tydlig backlog eller den är inte delad mellan alla.",
					"crawl":"Backlog finns men behov är inkompletta och inte prioriterade.",
					"walk":"Backlog innehåller fullt definierade behov, men är inte aggregerade till marknadsföringsbara funktioner.",
					"run":"Backlog innehåller fullt definierade behov, är aggregerade till funktioner men är inte  prioriterade (enligt WSJF, Avvägt snabbast arbete först).",
					"fly":"Backlog är en uppsättning av markandsföringsbara funktioner skapade med BDD och prioriterade enligt WSJF."
				}
			]
		},
		{
			"name":"2. Integrera",
			"questions":
			[
				{
                    "name":"Utveckling",
					"description":"Att utveckla med kontinuitet innebär att dela upp övergripande funktioner i behov, implementera behoven med hjälp av aktiviteter och med testdriven utveckling (eng. ”Test-Driven Development”, TDD) samt göra versionshanterade förändringar.",
					"question":"Bedöm leveransteamens förmåga att snabbt och stabilt definiera och genomföra aktiviteter",
					"image":"/images/integrate1.jpg",
					"sit":"Det finns ingen aktivitetslista på teamnivå och/eller den underhålls inte på daglig basis.",
					"crawl":"Aktiviteter är för övergripande eller otydliga; enhetstester och granskning görs vanligtvis inte.",
					"walk":"Aktiviteter är tydliga, enhetstester och granskning görs, men inte alltid.",
					"run":"Kod checkas in dagligen, enhetstester görs till ca 80% och kodgranskning alltid.",
					"fly":"Kod checkas in flera gånger per dag, enhetstester skrivs först (TDD), par-programmering och andra kvalitetsprocesser är standard."
				},
				{
                    "name":"Byggen",
					"description":"Bygge sker vid incheckning och innefattar kompilering, enhetstestning, merge till trunk/main sker enbart om kod är fungerande (s.k. gated-checkin) denna merge konstruerar ett deploybart paket som läggs ut.",
					"question":"Bedöm leveransteamets förmåga att bygga paket och få ut paket för test.",
					"image":"/images/integrate2.png",
					"sit":"Byggen körs inte alltid vid incheckning och/eller görs manuellt.",
					"crawl":"Byggen körs minst varje sprint och är delvis automatiserade; branch för utveckling är öppen i en månad eller mer. Byggen fungerar inte alltid.",
					"walk":"Byggen körs automatiskt varje dag. Byggen som inte fungerat fixas omgående; manuella enhetstester körs mot varje bygge; branch för utveckling är öppen i 2-4 veckor.",
					"run":"Byggen körs automatiskt vid varje incheckning; brutna byggen fixas direkt; automatiserade enhetstester körs vid varje bygge; branch för utveckling stängs efter varje sprint.",
					"fly":"Byggen körs vid varje incheckning; byggen inkluderar kod och säkerhetsanalys; ”gated checkins” används för att inte få in kod som bryter byggen; branch för utveckling stängs efter varje incheckning."
				},
				{
                    "name":"Testning",
					"description":"Testning innebär att validera på funktionsnivå (flera behov) i produktionsliknande miljö. Inkluderar funktionstestning, integrationstestning, regressionstestning, prestandatestning och utforskande testning.",
					"question":"Bedöm leveransteamets förmåga att kontinuerligt testa i produktionslika förhållande.",
					"image":"/images/integrate3.png",
					"sit":"Test sker manuellt i miljö som inte återspeglar produktion; test sker i större omgångar i schemalagd testfas.",
					"crawl":"Test sker mest manuellt i miljö som inte återspeglar produktion; behov implementeras och testas oberoende inom en leveransperiod.",
					"walk":"Hälften av testerna är automatiserade i produktionsliknande miljö inom varje leveransperiod.",
					"run":"De flesta tester är automatiserade i en produktionsliknande miljö; behov implementeras och testas fullt ut i varje sprint.",
					"fly":"Byggen kör automatiska tester i produktionslik miljö; alla tester är automatiserade; tester görs parallellt och valideras vid varje incheckning."
				},
				{
                    "name":"Acceptans",
					"description":"Acceptansmiljö (UAT) innebär att funktioner läggs ut på en fullständig kopia av produktionsmiljön, där de demonstreras för intressenter, acceptanstestas och används för utbildningsändamål innan produktionsstart.",
					"question":"Bedöm teamets förmåga att lägga ut funktioner och en acceptansmiljö för slutgiltig validering innan produktionssättning",
					"image":"/images/integrate4.jpg",
					"sit":"Det finns ingen acceptansmiljö eller testmiljön används som acceptansmiljö.",
					"crawl":"Funktioner läggs ut manuellt på en acceptansmiljö en gång per leveransperiod.",
					"walk":"Funktioner läggs ut i en acceptansmiljö omkring en gång per månad och visas för intressenter m.fl.",
					"run":"Funktioner och infrastruktur läggs ut automatiskt varje sprint och accepteras av verksamhetsområdet. ",
					"fly":"Behov och infrastrukturändringar läggs ut automatiskt, valideras och skickas sedan direkt vidare till produktionssättning (deploy)."
				}
			]
		},
		{
			"name":"3. Leverans",
			"questions":
			[
				{
                    "name":"Deploy",
					"description":"Deploy innefattar den faktiska överföringen av funktioner till produktionsmiljön. Den kontinuerliga leveransen separerar release och deploy (leverans), levererade funktioner är inte alltid live för användarna.",
					"question":"Bedöm teamets förmåga att kontinuerligt leverera och kontrollera tillgängligheten av funktioner i produktionsmiljön (feature toggle)",
					"sit":"Funktioner levereras mer sällan än var tredje månad.",
					"crawl":"Funktioner levereras under varje leveransperiod; deploy är mestadels manuell. Det finns ingen skillnad på levererad eller releasad.",
					"walk":"Funktioner levereras varje sprint, leveranser är mestadels automatiserade, vissa funktioner kan läggas ut utan att klassas som releasade.",
					"run":"Funktioner levereras varje sprint, fullt automatiserade. Features are deployed to production every iteration and fully automated through the pipeline; leveranser märks oftast inte (dark release).",
					"fly":"Funktioner läggs ut kontinuerligt under sprinten. Utvecklarteam initierar själva leveranser till produktion. Release är helt separerat från. Leveranser märks aldrig."
				},
				{
                    "name":"Verifikation",
					"description":"Driftsättningar måste verifieras fullständighet innan funktioner slås på för slutanvändarna.",
					"question":"Bedöm teamets förmåga att bedöma leveranser, återställa och/eller fixa leveransproblem.",
					"sit":"Leveranser är inte verifierade i produktion innan användaren får ta del av dom.",
					"crawl":"Leveranser är manuellt undersökta av smoke-test och/eller UAT. Eventuella problem fixas inom kort och ofta direkt i produktion direkt.",
					"walk":"Leveranser är verifierade manuellt innan de slås på för användare. Återställning är omständligt eller omöjligt. Vi gör aldrig justeringar i produktionsmiljön.",
					"run":"Leveranser verifieras av automatiserade smoke-tester, skriptad genomgång av vanliga funktioner och intrångstest görs innan användare får ta del av funktioner. Det är enkelt att göra återställning.",
					"fly":"Automatiserade tester körs kontinuerligt och uppdaterar övervakningssystem; leveranser som inte fungerar återställs ögonblickligen eller fixas direkt med hjälp av en ny leverans."
				},
				{
                    "name":"Monitorering",
					"description":"Monitorering innebär att alla funktioner som läggs ut övervakas så att prestanda och användarbeteende, incidenter med mera snabbt kan utvärderat i produktion",
					"question":"Bedöm teamets förmåga att monitorera samtliga delar i produktion (front-end, backed, infrastruktur m.m.) samt förmågan att bedöma värdet baserat på dessa mätvärden.",
					"sit":"Funktioner monitoreras inte; enbart infrastrukturen monitoreras.",
					"crawl":"Funktioner loggar fel och undantag (eng,. ”exceptions”); analys innebär manuell kontroll mellan olika system.",
					"walk":"Funktioner loggar fel samt system och data analyseras manuellt för att utreda incidenter och ge visst affärsvärde.",
					"run":"Funktioner monitorerar och loggar allt, monitorering koordineras av arkitekturen och presenteras i systemspecifika dashboards.",
					"fly":"Aggregerad monitorering för system ger ett system för fullständig insikt. Data används för att optimera prestanda och affärsvärde."
				},
				{
                    "name":"Åtgärda",
					"description":"Förmågan att upptäcka och återställa från oförutsedda produktionsincidenter är avgörande för en bra kontinuerlig leverans",
					"question":"Bedöm teamets förmåga att proaktivt identifiera incidenter i produktion och snabbt lösa incidenter genom att fixa saker genom den kontinuerliga leveransen (jämfört med att åtgärda saker direkt i produktion, hotfix)",
					"sit":"Verksamheten hittar incidenter innan IT. Att lösa prioriterade incidenter tar tid. Verksamheten har lågt förtroende IT:s förmåga att hantera incidenter.",
					"crawl":"Verksamheten hanterar produktionsproblem; IT kräver att incidenter eskaleras. Team skyller på varandra.",
					"walk":"Verksamhet och IT hanterar incidenter tillsammans; återställning från större incidenter är reaktivt men är team baserat.",
					"run":"Monitorering upptäcker de flesta incidenterna innan verksamheten gör det. IT och verksamhet arbetar proaktivt för att lösa större incidenter.",
					"fly":"Monitorering upptäcker och larmar vid allvarligare tillstånd. IT/Utvecklare ansvarar för kod och system och arbetar proaktivt för att lösa incidenter innan användare påverkas."
				}
			]
		},
		{
			"name":"4. Release",
			"questions":
			[
				{
                    "name":"Releasa",
					"description":"Release innebär att levererade funktioner blir tillgängliga för slutanvändare.",
					"question":"Bedöm teamets förmåga att slå på funktioner för slutanvändare vid behov (blue/green environments, canary releases, etc.)",
					"sit":"Releaser är synonymt med leverans och verksamheten är extremt missnöjda med frekvensen av nya funktioner.",
					"crawl":"Releaser är synonymt med leverans och verksamhet är något missnöjd med frekvensen av nya funktioner.",
					"walk":"Release och leverans är synonymt men sker samtidigt vid behov.",
					"run":"Release är avkopplat från leveransen. Funktioner slås på när verksamheten är redo.",
					"fly":"Release är avkopplat från leveransen. Funktioner slås på för individuella segment av verksamheten. Möjlighet att slå på/av tas bort när behov inte finns längre."
				},
				{
                    "name":"Stabilisering",
					"description":"En kontinuerlig leverans kräver att produktionsmiljön är stabil, pålitlig, tillgänglig, supporterbar och säker.",
					"question":"Bedöm teamets förmåga att bibehålla stabila lösningar som undviker oplanerad nedtid och säkerhetsbrister.",
					"sit":"Vi har ofta oplanerad nedtid och/eller säkerhetsbrister med långa återställningstider.",
					"crawl":"Vi har några oplanerade nedtider men håller SLA.",
					"walk":"Vi har få oplanerade nedtider. Tillgänglighet, säkerhet och \"disaster recovery\" fungerar bra och effektivt.",
					"run":"Vi har inga oplanerade nedtider. Vi planerar och övar återställning m.m.",
					"fly":"Vi maximerar stabilitet genom att medvetet injicera fel i produktion och öva återställning."
				},
				{
                    "name":"Mätning",
					"description":"Mätning innebär att man samlar in fakta om värdet av en levererad funktion samt utvärderar den mot det ursprungliga lösningsförslaget.",
					"question":"Bedöm teamets förmåga att samla in objektiva fakta om det faktiska värdet som realiserats av levererade funktioner så att de kan användas för strategiska ekonomiska beslut.",
					"sit":"Vi bedömer inte värdet för funktioner.",
					"crawl":"Vi bedömer ett värde men vi vet inte hur vi skall använda det.",
					"walk":"Vi samlar in kvalitativ återkoppling av värdet från verksamheten.",
					"run":"Vi samlar in både kvalitativ och kvantitativ återkoppling av värdet från verksamheten och från monitorerande system kring värdet av funktionerna.",
					"fly":"Vi aggregerar kvalitativ och kvantiativ återkoppling för att objektivt verifiera värdet mot lösningar och använda som beslutsunderlag för att förbättra eller byta ut (eng. ”pivot-or-persevere”)."
				},
				{
                    "name":"Lärande",
					"description":"Lärande innebär att man bedömer lösningsförslag baserat på objektiva mätningar av verksamhetsvärde, prestanda och återkoppling från verksamheten.",
					"question":"Bedöm teamets förmåga att fatta strategiska (förbättra/byt ut) beslut baserat på empirisk mätning av användande och prestanda. Information används för att kontinuerligt förbättra leveransströmmen.",
					"sit":"Funktioner utvärderas aldrig efter att de gjorts tillgängliga.",
					"crawl":"Vissa funktioner utvärderas subjektivt och genom användarnas åsikter.",
					"walk":"Lösningar utvärderas genom objektiv mätning men åtgärder styrs mycket av företagskultur och processer.",
					"run":"Lösningar utvärderas genom objektiv mätning förbättra/byt ut beslut görs utan omtanke eller skuld.",
					"fly":"Kontinuerligt lärande och experimenterande är en naturlig del av företagets kultur."
				}
			]
		}
	]
}